# -*- coding: utf-8 -*-
"""
Created on Sat Jul 29 13:05:08 2023

@author: Marko
"""

import pandas as pd

df = pd.read_csv('training_data.csv')

print(df.corr())
#Пояснення результату
#Результатом цього corr()методу є таблиця з великою кількістю чисел,
# яка показує, наскільки добре існує зв’язок між двома стовпцями.

#Число змінюється від -1 до 1.

# 1 означає, що існує співвідношення 1 до 1 (ідеальна кореляція), і для цього 
# набору даних щоразу, коли значення зростало в першому стовпці, інший також зростав.

# 0,9 також є хорошим співвідношенням, і якщо ви збільшите одне значення, 
# інше, ймовірно, також збільшиться.

# -0,9 було б таким же хорошим співвідношенням, як і 0,9, але якщо ви 
# збільшите одне значення, інше, ймовірно, знизиться.

# 0,2 означає НЕ хороше співвідношення, тобто якщо одне значення підвищиться, 
# це не означає, що підвищиться інше.

# Що таке хороша кореляція? Це залежить від використання, але я думаю, що можна
# з упевненістю сказати, що ви повинні мати принаймні 0.6(або -0.6), щоб назвати це хорошою кореляцією.

# Ідеальна кореляція:
# Ми бачимо, що «Тривалість» і «Тривалість» отримали число 1.000000, що має сенс,
# оскільки кожен стовпець завжди має ідеальний зв’язок із самим собою.

# Хороша кореляція:
# «Тривалість» і «Калорії» мають 0.922721кореляцію, яка є дуже хорошою кореляцією,
# і ми можемо передбачити, що чим довше ви тренуєтеся, тим більше спалюєте калорій,
# і навпаки: якщо ви спалили багато калорій, мабуть довго тренувався.

# Погана кореляція:
# «Тривалість» і «Максимальний пульс» мають кореляцію 0.009403, яка є дуже #
# поганою кореляцією, тобто ми не можемо передбачити максимальний пульс, просто
# дивлячись на тривалість тренування, і навпаки.